<template>
  <div class="sidebar-container">
    <div class="sidebar-header">
      <router-link to="/" class="sidebar-logo">
        <!-- Logo SVG -->
        <svg
          width="50"
          height="50"
          viewBox="0 0 50 50"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M30.6996 23.4709C30.6996 23.4709 23.2328 35.5781 17.1109 35.5781C6.40314 35.5781 16.3821 12.5132 24.1916 12.5132C29.641 12.5132 30.6996 23.4709 30.6996 23.4709Z"
            fill="#FF6600"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M39.5723 38.6972C37.4451 40.9607 34.8198 42.6976 31.9044 43.7701C28.989 44.8426 25.8639 45.2213 22.7767 44.8761C19.6895 44.5309 16.7252 43.4713 14.1188 41.7813C11.5125 40.0914 9.33573 37.8175 7.76123 35.1401C9.5314 37.5477 12.5338 39.1527 16.803 39.1527C27.3199 39.1527 33.2899 30.98 33.2899 30.98C33.2899 30.98 33.8062 37.4392 39.5593 38.6972H39.5723Z"
            fill="#FF6600"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M42.7223 15.7451C44.2963 18.7527 45.0781 22.1116 44.9939 25.505C44.9096 28.8984 43.9621 32.2144 42.2407 35.1401C40.8792 34.3764 39.8725 33.1082 39.4379 31.609L37.1558 24.7724L42.7223 15.7451Z"
            fill="#FF6600"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M25.0031 5.01737C30.0185 5.01403 34.8513 6.89881 38.5398 10.2967L34.7521 16.4088C33.3811 12.843 30.5957 9.2729 25.1767 9.2729C14.0784 9.2729 5.85231 21.3888 5.85231 28.9846C5.84986 29.9669 5.97528 30.9454 6.22543 31.8953C5.11558 28.8725 4.75205 25.6265 5.16572 22.4331C5.57938 19.2398 6.75802 16.1934 8.60147 13.5531C10.4449 10.9127 12.8987 8.75634 15.7542 7.26726C18.6097 5.77818 21.7826 5.00039 25.0031 5V5.01737Z"
            fill="#FF6600"
          />
        </svg>
        <!-- Logo SVG -->
      </router-link>
    </div>
    <div class="sidebar-items">
      <button
        @click="activeTab = 'home'"
        :class="{ active: activeTab === 'home' }"
        class="sidebar-item home"
        type="button"
      >
        <router-link to="/main">
          <!-- Home SVG -->
          <svg
            class="item-icon"
            width="24"
            height="22"
            viewBox="0 0 24 22"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M22.58 6.34986L12.475 0.896855C12.178 0.736855 11.821 0.736855 11.525 0.896855L1.42502 6.34986C0.939018 6.61386 0.758018 7.21986 1.02002 7.70586C1.20002 8.04086 1.54502 8.23086 1.90002 8.23086C2.06002 8.23086 2.22402 8.19286 2.37502 8.11086L3.10902 7.71486L4.69902 18.9649C4.91502 20.1789 6.00902 21.0269 7.35902 21.0269H16.641C17.991 21.0269 19.085 20.1789 19.303 18.9389L20.891 7.71386L21.628 8.11186C22.113 8.37486 22.72 8.19386 22.982 7.70786C23.245 7.22186 23.062 6.61486 22.578 6.35286L22.58 6.34986ZM12 14.4349C10.205 14.4349 8.75002 12.9799 8.75002 11.1849C8.75002 9.38986 10.205 7.93486 12 7.93486C13.795 7.93486 15.25 9.38986 15.25 11.1849C15.25 12.9799 13.795 14.4349 12 14.4349Z"
              fill="#1C1C1C"
            />
          </svg>
          <!-- Home SVG -->
          <div class="item-name">首頁</div>
        </router-link>
      </button>

      <button
        @click="activeTab = 'userInfo'"
        :class="{ active: activeTab === 'userInfo' }"
        class="sidebar-item userInfo"
        type="button"
      >
        <router-link to="/profile">
          <!-- User SVG -->
          <svg
            class="item-icon"
            width="18"
            height="21"
            viewBox="0 0 18 21"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M9.00003 10.8158C10.355 10.8158 11.872 10.6658 12.84 9.55976C13.654 8.62976 13.918 7.19176 13.646 5.16776C13.266 2.34276 11.529 0.655762 9.00003 0.655762C6.47103 0.655762 4.73403 2.34276 4.35403 5.16976C4.08203 7.19176 4.34603 8.62976 5.16003 9.55976C6.12803 10.6668 7.64503 10.8158 9.00003 10.8158ZM5.84003 5.36776C6.00203 4.16776 6.62703 2.15576 9.00003 2.15576C11.373 2.15576 11.998 4.16876 12.16 5.36776C12.367 6.91776 12.217 7.99476 11.71 8.57276C11.255 9.09276 10.444 9.31576 9.00003 9.31576C7.55603 9.31576 6.74503 9.09276 6.29003 8.57276C5.78303 7.99476 5.63303 6.91676 5.84003 5.36776ZM17.28 18.2358C16.403 14.7098 12.998 12.2458 9.00003 12.2458C5.00203 12.2458 1.59703 14.7098 0.720027 18.2358C0.548027 18.9278 0.692027 19.6358 1.11503 20.1758C1.52303 20.6958 2.15503 20.9958 2.84803 20.9958H15.152C15.845 20.9958 16.477 20.6958 16.885 20.1758C17.309 19.6358 17.452 18.9288 17.279 18.2358H17.28ZM15.704 19.2518C15.578 19.4118 15.388 19.4978 15.152 19.4978H2.84803C2.61303 19.4978 2.42203 19.4128 2.29603 19.2518C2.15903 19.0778 2.11603 18.8398 2.17603 18.5978C2.88603 15.7428 5.69303 13.7478 9.00003 13.7478C12.307 13.7478 15.114 15.7418 15.824 18.5978C15.884 18.8398 15.841 19.0778 15.704 19.2518Z"
              fill="black"
            />
          </svg>
          <!-- User SVG -->
          <div class="item-name">個人資料</div>
        </router-link>
      </button>

      <button
        @click="activeTab = 'setting'"
        :class="{ active: activeTab === 'setting' }"
        class="sidebar-item setting"
        type="button"
      >
        <router-link to="/setting">
          <!-- Setting SVG -->
          <svg
            class="item-icon"
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M12 8.20996C9.90996 8.20996 8.20996 9.90996 8.20996 12C8.20996 14.09 9.90996 15.79 12 15.79C14.09 15.79 15.79 14.09 15.79 12C15.79 9.90996 14.09 8.20996 12 8.20996ZM12 14.29C10.738 14.29 9.70996 13.264 9.70996 12C9.70996 10.736 10.74 9.70996 12 9.70996C13.26 9.70996 14.29 10.736 14.29 12C14.29 13.264 13.262 14.29 12 14.29Z"
              fill="black"
            />
            <path
              d="M12.36 22.375H11.638C10.455 22.375 9.48399 21.487 9.37599 20.311L9.36199 20.164C9.33699 19.877 9.15499 19.631 8.88999 19.52C8.60399 19.4 8.30799 19.455 8.09199 19.635L7.97599 19.732C7.10799 20.457 5.72299 20.395 4.91599 19.592L4.40599 19.082C3.56999 18.242 3.50999 16.928 4.26599 16.022L4.36399 15.904C4.54999 15.682 4.59399 15.381 4.48599 15.117C4.37599 14.845 4.12799 14.663 3.83999 14.637L3.68999 14.623C2.50999 14.516 1.62299 13.543 1.62299 12.361V11.639C1.62299 10.456 2.51099 9.485 3.68699 9.377L3.84299 9.363C4.12799 9.338 4.37299 9.156 4.48499 8.89C4.59499 8.62 4.54999 8.317 4.36499 8.095L4.27099 7.979C3.51399 7.071 3.57299 5.756 4.40799 4.919L4.91999 4.407C5.72399 3.603 7.10799 3.542 7.97999 4.267L8.09599 4.365C8.31399 4.549 8.62399 4.595 8.88599 4.487C9.15599 4.375 9.33799 4.129 9.36299 3.844L9.37699 3.691C9.48399 2.511 10.457 1.625 11.639 1.625H12.361C13.544 1.625 14.515 2.513 14.623 3.689L14.637 3.845C14.662 4.13 14.843 4.375 15.109 4.485C15.386 4.602 15.689 4.547 15.903 4.368L16.023 4.266C16.89 3.543 18.277 3.604 19.083 4.406L19.593 4.918C20.429 5.756 20.489 7.071 19.733 7.978L19.633 8.096C19.445 8.316 19.399 8.618 19.51 8.884C19.622 9.154 19.87 9.334 20.156 9.362L20.308 9.376C21.488 9.483 22.375 10.456 22.375 11.638V12.361C22.375 13.544 21.487 14.515 20.311 14.623L20.156 14.637C19.872 14.661 19.626 14.842 19.516 15.107C19.403 15.379 19.449 15.681 19.633 15.902L19.733 16.022C20.489 16.927 20.429 18.242 19.593 19.082L19.083 19.592C18.276 20.396 16.893 20.456 16.023 19.732L15.908 19.636C15.691 19.453 15.378 19.406 15.118 19.514C14.845 19.628 14.663 19.874 14.638 20.16L14.624 20.31C14.517 21.483 13.544 22.37 12.362 22.37L12.36 22.375ZM8.58699 17.955C8.88699 17.955 9.17999 18.015 9.45699 18.13C10.247 18.458 10.781 19.184 10.857 20.026L10.871 20.173C10.908 20.573 11.238 20.873 11.641 20.873H12.363C12.763 20.873 13.093 20.573 13.131 20.173L13.145 20.025C13.221 19.183 13.755 18.458 14.537 18.133C15.33 17.803 16.233 17.951 16.87 18.483L16.983 18.577C17.161 18.725 17.349 18.757 17.476 18.757C17.682 18.757 17.876 18.677 18.022 18.53L18.532 18.02C18.816 17.736 18.837 17.29 18.58 16.982L18.48 16.862C17.938 16.212 17.803 15.322 18.128 14.539C18.454 13.749 19.18 13.219 20.022 13.142L20.177 13.128C20.574 13.091 20.877 12.761 20.877 12.358V11.636C20.877 11.236 20.574 10.906 20.175 10.868L20.023 10.854C19.177 10.776 18.453 10.244 18.128 9.461C17.802 8.673 17.938 7.783 18.481 7.134L18.581 7.016C18.838 6.706 18.817 6.26 18.533 5.976L18.023 5.466C17.877 5.319 17.683 5.239 17.477 5.239C17.35 5.239 17.162 5.271 16.985 5.419L16.865 5.519C16.231 6.047 15.315 6.189 14.543 5.873C13.755 5.546 13.223 4.821 13.146 3.977L13.132 3.822C13.097 3.425 12.767 3.122 12.365 3.122H11.642C11.242 3.122 10.912 3.425 10.874 3.824L10.86 3.976C10.784 4.819 10.252 5.544 9.46999 5.869C8.68299 6.195 7.77699 6.052 7.13999 5.519L7.02199 5.423C6.84199 5.273 6.65399 5.243 6.52699 5.243C6.32099 5.243 6.12699 5.323 5.98099 5.469L5.46899 5.979C5.18699 6.263 5.16599 6.709 5.42299 7.017L5.52299 7.135C6.06299 7.788 6.19999 8.679 5.87499 9.46C5.54799 10.248 4.82299 10.78 3.97999 10.857L3.82399 10.871C3.42699 10.908 3.12399 11.238 3.12399 11.641V12.363C3.12399 12.763 3.42699 13.093 3.82599 13.131L3.97599 13.145C4.82399 13.223 5.54899 13.757 5.87299 14.541C6.19799 15.327 6.06299 16.216 5.51999 16.866L5.42399 16.981C5.16399 17.291 5.18599 17.737 5.46999 18.021L5.97999 18.531C6.12599 18.678 6.31999 18.758 6.52599 18.758C6.65299 18.758 6.84099 18.728 7.01799 18.578L7.13399 18.482C7.53999 18.146 8.05699 17.958 8.58699 17.958V17.955Z"
              fill="black"
            />
          </svg>
          <!-- Setting SVG -->
          <div class="item-name">設定</div>
        </router-link>
      </button>


      <button class="twitter-btn" type="submit" >推文</button>
      <button class="logout-item">
        <router-link to="/login">
          <img src="../assets/image/logout.svg" class="logout-icon" />
          <span class="logout">登出</span>
        </router-link>
      </button>
    </div>

      <button
        @click="$bus.$emit('tweetModal', true)"
        class="twitter-btn"
        type="submit"
      >
        推文
      </button>
    </div>
    <button class="logout-item">
      <router-link to="/login">
        <img src="../assets/image/logout.svg" class="logout-icon" />
        <span class="logout">登出</span>
      </router-link>
    </button>
    <TweetModal />

  </div>
</template>

<script>
import TweetModal from '../components/TweetModal.vue'
import { mapState } from 'vuex'

export default {
  components: { TweetModal },

  data(){
    return{
      activeTab:false
    }
  },

  computed: {
    ...mapState(['currentUser'])
  },

  watch:{
    // 有home, userInfo, setting 三種
    // 到其他人的跟隨中列表、跟髓者列表取消
    'this.$route.params.id'(){
      this.currentUser.id === this.$route.params.id?(this.activeTab ='userInfo'):(this.activeTab =false)
    }
  }
}
</script>

<style lang="scss" scoped>
.sidebar-container {
  width: 235px;
  @include flex(column, flex-start, flex-start);
  @include margin(4px, 0, 0, 103px);
  position: relative;
}

.sidebar-header {
  @include size(50px, 50px);
  margin-bottom: 35px;
  position: relative;
}

.sidebar-logo {
  @include size(50px, 50px);
  @include position(absolute, 50%, 0, 0, 50%);
  transform: translate(-50%, -50%);

  &.active {
    color: var(--theme-color);
    svg > path {
      fill: var(--theme-color);
    }
  }

  &:hover {
    color: var(--hover-color);
    svg > path {
      fill: var(--hover-color);
    }
  }

  &:focus {
    color: var(--focus-color);
    svg > path {
      fill: var(--focus-color);
    }
  }
}

.sidebar-item {
  @include flex(row, flex-start, center);
  align-content: center;
  margin-left: 10px;

  &:nth-child(2) {
    margin-top: 30px;
    margin-bottom: 31px;
  }

  color: var(--main-text);
  svg > path {
    fill: var(--main-text);
  }

  //
  & > a.active {
    color: var(--theme-color);
    svg > path {
      fill: var(--theme-color);
    }
  }

  &:hover {
    color: var(--hover-color);
    svg > path {
      fill: var(--hover-color);
    }
  }

  &:focus {
    color: var(--focus-color);
    svg > path {
      fill: var(--focus-color);
    }
  }
}

.item-name {
  font-size: 18px;
  font-weight: 700;
  line-height: 26.06px;
}

.item-icon {
  margin-right: 20px;
  @include size(24px, 24px);
}

a {
  @include flex(row, flex-start, center);
}

.twitter-btn {
  @include size(210px, 38px);
  background-color: var(--theme-color);
  color: var(--just-white);
  border-radius: 100px;
  margin-top: 24px;
  font-size: 18px;
  font-weight: 500;
  line-height: 18px;
  &:hover {
    background-color: var(--hover-color);
  }
  &:active,
  &:focus {
    background-color: var(--focus-color);
  }
}

// TODO: 下面這個要刪除嗎?
.newClass {
  box-shadow: 0px 0px 5px #000;
  background-color: green;
  color: #fff;
  padding: 3px 5px;
}

// logout btn 固定不動
.logout-item {
  position: fixed;
  bottom: 17px;
  margin-left: 8px;
  display: flex;
}

.logout-icon {
  @include size(24px, 24px);
}

.logout {
  margin-left: 20px;
  font-size: 18px;
  font-weight: 700;
  line-height: 26.06px;
}
</style>
